run/cokeCombustion/T573_Pe1e-1/constant/thermo.Gas
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermo.Gas;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

O2
{
    specie
    {
        molWeight       32.0;
    }
    thermodynamics
    {
        Cp              1070.8;
        Hf              0;
    }
    transport
    {
        mu              3.3747E-05;
        Pr              0.73029;
    }
}



N2
{
    specie
    {
        molWeight       28.0;
    }
    thermodynamics
    {
        Cp              1070.8;
        Hf              0;
    }
    transport
    {
        mu              2.8708E-05;
        Pr              0.70843;
    }
}

CO2
{
    specie
    {
        molWeight       44.00;
    }
    thermodynamics
    {
        Cp              1070.8;
        Hf              0;
    }
    transport
    {
        mu              2.6995E-05;
        Pr              0.72832;
    }
}


// ************************************************************************* //
